<a href="https://colab.research.google.com/github/diflores/ayudantia-1-iic1005-2019-2/blob/master/Ayudantia_1.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# IIC1005: Ayudantía 1

#### 14 de marzo de 2018.

###### Esta ayudantía está inspirada en la Ayudantía 2 de la versión 2017-2 de este curso. Puedes encontrar la original [aquí](https://github.com/diflores/iic1005-ayudantia-2).

## *Jupyter notebooks*

**¿Qué es un *notebook*?**

Un *notebook* es un documento generado por la *Jupyter Notebook App*. Estos documentos contienen código ejecutable y también elementos más amigables para el ser humano común, tales como párrafos, ecuaciones e hipervínculos. Estas características convierten a los *notebooks* en herramientas ideales para aprender Python, procesar datos y aventurarse *machine learning*.

Los *notebooks* se componen de una serie de celdas, que pueden ser de distintos tipos. Por lo general, utilizaremos solo dos:

- Code (para escribir código ejecutable).
- [*Markdown*](https://guides.github.com/features/mastering-markdown/) (para escribir párrafos en dicho lenguage de marcación).

La celda actual es una celda de tipo *markdown*. La siguiente, corresponde a una de tipo *code*. Puedes ejecutar su código presionando el ícono ▶️:

In [22]:
print("¡Hola mundo!")

¡Hola mundo!

También puedes ejecutar el código de una celda presionando shift + enter, lo que ejecutará el código y avanzará a la celda siguiente. Si deseas ejecutar el código, pero mantenerte en la celda correspondiente, utiliza ctrl + enter. Si quieres aprender más atajos de teclado, presiona esc + h

## Pandas

**¿Qué es pandas?**

Pandas es una librería de Python que nos permitirá manipular datos de manera sencilla.

**¿Por qué no utilizamos las estructuras de datos de Python para esto?**

Porque aun cuando sirvan para solucionar el problema, su uso en esta misión no es eficiente. 

### Conceptos básicos de pandas: *Series* y *DataFrames*

Pandas cuenta con dos estructuras de datos principales, las *Series* y los *DataFrames*. Una Series puede ser comprendida como una columna de datos. Un *DataFrame*, por su parte, puede ser visto como un conjunto de *Series*.

A continuación, revisaremos un ejemplo sencillo, que nos permitirá introducirnos al uso de pandas. Lo primero que debemos hacer es importar la librería:

In [0]:
import pandas as pd

En este ejemplo, utilizaremos un *dataset* de transacciones de enero de 2009, el que fue obtenido desde [aquí](https://support.spatialkey.com/spatialkey-sample-csv-data/). Lo primero que debemos hacer es cargar los datos. Para ello, la librería pandas provee un método muy útil llamado `read_csv`.

In [3]:
!wget -O SalesJan2009.csv https://gist.githubusercontent.com/diflores/e11af543eb64090d2446f231f2e84f0f/raw/94cdd2b4de0716ba70ef89b69674d53737ce8a9c/SalesJan2009.csv

--2019-08-21 19:42:56--  https://gist.githubusercontent.com/diflores/e11af543eb64090d2446f231f2e84f0f/raw/94cdd2b4de0716ba70ef89b69674d53737ce8a9c/SalesJan2009.csv
Resolving gist.githubusercontent.com (gist.githubusercontent.com)... 151.101.0.133, 151.101.64.133, 151.101.128.133, ...
Connecting to gist.githubusercontent.com (gist.githubusercontent.com)|151.101.0.133|:443... connected.
HTTP request sent, awaiting response... 200 OK
Length: 114979 (112K) [text/plain]
Saving to: ‘SalesJan2009.csv’

SalesJan2009.csv    100%[===================>] 112.28K  --.-KB/s    in 0.04s

2019-08-21 19:42:56 (2.97 MB/s) - ‘SalesJan2009.csv’ saved [114979/114979]

In [0]:
dataset = pd.read_csv("SalesJan2009.csv")

### Explorando los datos mediante preguntas *interesantes*
Antes de manipular los datos, es conveniente explorarlos. Inicialmente, podríamos preguntarnos: ¿qué columnas contiene el *dataset* recién cargado? Podemos obtener esta información ejecutando la siguiente celda:

In [5]:
dataset.columns

Index(['Transaction_date', 'Product', 'Price', 'Payment_Type', 'Name', 'City',
       'State', 'Country', 'Account_Created', 'Last_Login', 'Latitude',
       'Longitude'],
      dtype='object')

**¿Cuántas filas tiene el *dataset*?**

In [6]:
len(dataset)

998

**¿Cómo se ve el *dataset*?**

In [7]:
dataset.sample(10)

    Transaction_date   Product Price  ...     Last_Login    Latitude   Longitude
362     1/13/09 8:20  Product1  1200  ...   1/29/09 3:25   51.300000   -0.050000
738    1/29/09 17:13  Product1  1200  ...       40.92528  -73.963330         NaN
37      1/8/09 16:24  Product1  1200  ...       33.44833 -112.073330         NaN
648     1/9/09 20:25  Product1  1200  ...  2/11/09 20:19   49.900000 -119.483333
908     1/23/09 9:27  Product1  1200  ...  2/25/09 11:38   40.400000   -3.683333
678    1/14/09 16:02  Product1  1200  ...  2/13/09 16:45   34.168330 -118.605000
863    1/15/09 15:56  Product2  3600  ...       39.69861  -86.463610         NaN
20      1/6/09 12:56  Product1  1200  ...   1/6/09 13:31   53.500000   -2.216667
461     1/25/09 8:54  Product1  1200  ...    2/3/09 9:50   33.867220 -112.146110
972      1/4/09 9:28  Product1  1200  ...   2/28/09 2:28   51.266667    0.516667

[10 rows x 12 columns]

Pandas también nos permite responder preguntas un poco más interesantes como:

**¿Cuáles son las transacciones que fueron realizadas en Noruega?**

In [8]:
dataset[dataset["Country"] == "Norway"]

    Transaction_date   Product Price  ...     Last_Login   Latitude  Longitude
67     1/11/09 11:33  Product1  1200  ...  1/12/09 10:37  58.966667   5.750000
79      1/8/09 13:14  Product1  1200  ...  1/13/09 10:49  59.916667  10.750000
213    1/21/09 11:36  Product1  1200  ...  1/21/09 13:47  59.916667  10.750000
234     1/1/09 14:22  Product1  1200  ...  1/22/09 14:38  58.966667   5.750000
262     1/10/09 3:28  Product1  1200  ...  1/24/09 15:10  59.413611  10.466944
387    1/11/09 14:56  Product1  1200  ...   1/31/09 4:21  61.550000   6.350000
408     1/9/09 16:35  Product1  1200  ...    2/1/09 4:18  59.860833  10.790556
429      1/6/09 3:39  Product1  1200  ...    2/2/09 0:08  60.391111   5.324722
608     1/13/09 9:14  Product1  1200  ...   2/10/09 9:04  60.633333   6.433333
683     1/28/09 4:35  Product1  1200  ...  2/13/09 23:15  59.916667  10.750000
831     1/25/09 8:16  Product2  3600  ...  2/20/09 23:22  59.916667  10.750000
897    1/19/09 10:47  Product1  1200  ...   2/25/09 0:40  58.966667   5.750000
909    1/22/09 12:56  Product1  1200  ...  2/25/09 12:03  59.348889  10.467500
925      1/2/09 4:21  Product1  1200  ...   2/26/09 3:18  59.816667  10.250000

[14 rows x 12 columns]

**¿Cuáles son las transacciones que fueron realizadas con una tarjeta Visa en los Países Bajos?**

In [9]:
dataset[(dataset["Country"] == "Netherlands") & (dataset["Payment_Type"] == "Visa")]

    Transaction_date   Product Price  ...     Last_Login   Latitude Longitude
224    1/21/09 14:25  Product1  1200  ...   1/22/09 0:38  52.550000  4.666667
660    1/27/09 12:47  Product1  1200  ...  2/12/09 12:59  52.350000  4.916667
712    1/19/09 15:40  Product2  3600  ...  2/15/09 10:33  52.033333  5.666667
841    1/30/09 23:49  Product2  3600  ...  2/21/09 14:05  52.233333  5.183333

[4 rows x 12 columns]

La librería pandas nos permite resolver preguntas aun más interesantes, tales como **¿cuáles son los países con la mayor cantidad de transacciones?**. Para contestar esto, haremos uso de `group_by`, que, en palabras sencillas, nos permite agrupar las filas de un DataFrame de acuerdo a alguna(s) columna(s).

In [10]:
dataset.groupby(["Country"]).count()["Transaction_date"].sort_values(ascending=False)[0:4]

Country
United States     121
United Kingdom     94
Canada             71
Ireland            45
Name: Transaction_date, dtype: int64

Ahora queremos saber cuánto dinero fue transado por cada medio de pago:

In [11]:
dataset.groupby(["Payment_Type"])["Price"].sum()

Payment_Type
Amanda                                               Mastercard
Amex          1200120036003600120012001200120012001200120012...
Diners        1200120012001200120012001200120036001200120012...
Mastercard    1200120012001200120012001200120012001200120012...
Visa          1200120036001200120012001200120036001200120012...
Name: Price, dtype: object

#### Propuesto: ¿Cuál fue el producto más vendido dentro de Estados Unidos?

In [21]:
# Escribe tu solución aquí
dataset[dataset["Country"] == "United States"]["Product"].value_counts()

Product1    106
Product2     11
Product3      4
Name: Product, dtype: int64

In [13]:
dataset.Country.unique

<bound method Series.unique of 0      United Kingdom
1       United States
2        1/1/09 16:21
3           Australia
4      11/15/08 15:47
5       United States
6       United States
7       United States
8              Israel
9              France
10        1/5/09 2:23
11        Netherlands
12        1/5/09 9:05
13     11/11/08 15:53
14      United States
15            Ireland
16             Canada
17              India
18     United Kingdom
19      United States
20     United Kingdom
21            Ireland
22       South Africa
23        1/6/09 7:07
24            Finland
25        1/1/09 1:56
26        1/7/09 7:39
27     United Kingdom
28      United States
29      United States
            ...
968         Australia
969      1/5/09 18:16
970    12/24/07 22:59
971    Czech Republic
972    United Kingdom
973    United Kingdom
974           Romania
975      3/30/06 2:02
976     11/3/05 18:14
977    United Kingdom
978            Turkey
979     United States
980    United Kingdom
981       New Zealand
982         Australia
983         Guatemala
984             Spain
985     6/20/04 17:16
986     6/10/05 20:25
987         Australia
988         Australia
989           Finland
990           Austria
991       Switzerland
992    United Kingdom
993    United Kingdom
994         Mauritius
995    12/28/08 17:28
996    United Kingdom
997      3/1/09 10:14
Name: Country, Length: 998, dtype: object>

El retorno de la celda anterior debería verse más o menos así:

### Agregando información al dataset

Queremos agregar una columna que indique cuán satisfecho quedó el cliente con su transacción. La medida de satisfacción que utilizaremos será una nota de 1 a 5. Primero definimos una función que entregue $n$ *ratings* aleatorios.

In [0]:
import random

def random_ratings(number):
    ratings = []
    for i in range(number):
        rating = random.choice(range(1,6))
        ratings.append(rating)
    return ratings

Ahora agregamos la columna de ratings de la siguiente manera:

In [0]:
ratings = random_ratings(len(dataset))
dataset["Rating"] = ratings

Revisemos si efectivamente se añadió la columna:

In [16]:
dataset.sample(5)

    Transaction_date   Product Price  ...   Latitude   Longitude Rating
379     1/5/09 11:21  Product1  1200  ...  50.983333   -0.600000      4
747     1/8/09 23:00  Product1  1200  ...  41.159444   28.912778      4
222     1/7/09 22:29  Product1  1200  ...  61.218060 -149.900280      5
392     1/31/09 9:12  Product1  1200  ...  51.433333   -1.000000      4
823     1/31/09 1:59  Product1  1200  ...  45.466667    9.200000      1

[5 rows x 13 columns]

Imaginemos que queremos cambiar los números de rating 1-5 a algo más descriptivo:

- 1: Very Dissatisfied.
- 2: Somewhat Dissatisfied.
- 3: Neither Satisfied Nor Dissatisfied.
- 4: Somewhat Satisfied.
- 5: Very Satisfied.

¿Cómo lo hacemos? El método `apply` nos ayudará mucho.

En primer lugar, conviene definir una función que dado un *rating* numérico, retorne la medida de satisfacción en palabras:

In [0]:
def convert(rating):
    if rating == 1:
        return "Very Dissatisfied"
    elif rating == 2:
        return "Somewhat Dissatisfied"
    elif rating == 3:
        return "Neither Satisfied Nor Dissatisfied"
    elif rating == 4:
        return "Somewhat Satisfied"
    else:
        return "Very Satisfied"

Posteriormente, aplicamos la función a la columna *Ratings*:

In [0]:
dataset["Rating"] = dataset["Rating"].apply(convert)

Veamos cómo quedó el dataset:

In [19]:
dataset.head()

  Transaction_date   Product  ...   Longitude                              Rating
0      1/2/09 6:17  Product1  ...   -1.116667                   Very Dissatisfied
1      1/2/09 4:53  Product1  ...  -94.681940                   Very Dissatisfied
2     1/2/09 13:08  Product1  ...         NaN  Neither Satisfied Nor Dissatisfied
3     1/3/09 14:44  Product1  ...  144.750000               Somewhat Dissatisfied
4     1/4/09 12:56  Product2  ...         NaN                   Very Dissatisfied

[5 rows x 13 columns]

Esto ha sido solo una pequeña introducción a pandas. Es muy posible que en tu tarea debas emplear algunas cosas que no vimos en esta ayudantía, por lo que deberás investigar por tu cuenta. Recuerda que ante cualquier duda, los ayudantes estamos a tu completa disposición.